scripts/UC_2_buyItem/result1/Iteration4/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>4SarahWill</ns2:safePayUsername><ns2:safePayPassword>f8399b4b4790f0d8f9ee53e66b9da3935c5852c4</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886678901234567</ns2:cardNumber><ns2:expirationDate>102026</ns2:expirationDate><ns2:cvvNumber>077</ns2:cvvNumber><ns2:customerName>Sarah Williams</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>